src/cf/InformationRegisters/СостоянияСинхронизацииОблачногоЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостоянияСинхронизацииОблачногоЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСинхронизации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторУчетнойЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСинхронизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСинхронизацииОблачногоЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СостоянияСинхронизацииОблачногоЭДО/Ext/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  ИдентификаторУчетнойЗаписи - см. РегистрСведений.СостоянияСинхронизацииОблачногоЭДО.ИдентификаторУчетнойЗаписи
//  ТипСинхронизации - см. РегистрСведений.СостоянияСинхронизацииОблачногоЭДО.ТипСинхронизации
//  ДатаСинхронизации - см. РегистрСведений.СостоянияСинхронизацииОблачногоЭДО.ДатаСинхронизации
Процедура Записать(ИдентификаторУчетнойЗаписи, ТипСинхронизации, ДатаСинхронизации) Экспорт
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторУчетнойЗаписи.Установить(ИдентификаторУчетнойЗаписи);
	НаборЗаписей.Отбор.ТипСинхронизации.Установить(ТипСинхронизации);
	ЗаписьНабора = НаборЗаписей.Добавить();
	ЗаписьНабора.ИдентификаторУчетнойЗаписи = ИдентификаторУчетнойЗаписи;
	ЗаписьНабора.ТипСинхронизации = ТипСинхронизации;
	ЗаписьНабора.ДатаСинхронизации = ДатаСинхронизации;
	НаборЗаписей.Записать();
КонецПроцедуры

// Параметры:
//  ИдентификаторыУчетныхЗаписей - Массив из см. РегистрСведений.СостоянияСинхронизацииОблачногоЭДО.ИдентификаторУчетнойЗаписи
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//  * ИдентификаторУчетнойЗаписи - см. РегистрСведений.СостоянияСинхронизацииОблачногоЭДО.ИдентификаторУчетнойЗаписи
//  * ТипСинхронизации - см. РегистрСведений.СостоянияСинхронизацииОблачногоЭДО.ТипСинхронизации
//  * ДатаСинхронизации - см. РегистрСведений.СостоянияСинхронизацииОблачногоЭДО.ДатаСинхронизации
Функция Выгрузить(ИдентификаторыУчетныхЗаписей = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СостоянияСинхронизацииОблачногоЭДО.ИдентификаторУчетнойЗаписи,
		|	СостоянияСинхронизацииОблачногоЭДО.ТипСинхронизации,
		|	СостоянияСинхронизацииОблачногоЭДО.ДатаСинхронизации
		|ИЗ
		|	РегистрСведений.СостоянияСинхронизацииОблачногоЭДО КАК СостоянияСинхронизацииОблачногоЭДО";
	
	Если ЗначениеЗаполнено(ИдентификаторыУчетныхЗаписей) Тогда
		Запрос.Текст = Запрос.Текст + "
			|ГДЕ
			|	СостоянияСинхронизацииОблачногоЭДО.ИдентификаторУчетнойЗаписи В (&ИдентификаторыУчетныхЗаписей)";
		Запрос.УстановитьПараметр("ИдентификаторыУчетныхЗаписей", ИдентификаторыУчетныхЗаписей);
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Параметры:
//  ИдентификаторУчетнойЗаписи - см. РегистрСведений.СостоянияСинхронизацииОблачногоЭДО.ИдентификаторУчетнойЗаписи
//  ТипСинхронизации - см. РегистрСведений.СостоянияСинхронизацииОблачногоЭДО.ТипСинхронизации
// 
// Возвращаемое значение:
//  См. РегистрСведений.СостоянияСинхронизацииОблачногоЭДО.ДатаСинхронизации
Функция ДатаСинхронизацииПоТипу(ИдентификаторУчетнойЗаписи, ТипСинхронизации) Экспорт
	
	Выборка = ВыборкаДатыСинхронизацииПоТипу(ИдентификаторУчетнойЗаписи, ТипСинхронизации);
	
	Если Выборка.Следующий() Тогда
		ДатаСинхронизации = Выборка.ДатаСинхронизации;
	Иначе
		ДатаСинхронизации = '00010101';
	КонецЕсли;
	
	Возврат ДатаСинхронизации;
	
КонецФункции

// Параметры:
//  ИдентификаторУчетнойЗаписи - см. РегистрСведений.СостоянияСинхронизацииОблачногоЭДО.ИдентификаторУчетнойЗаписи
//  ТипСинхронизации - см. РегистрСведений.СостоянияСинхронизацииОблачногоЭДО.ТипСинхронизации
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
//  * ДатаСинхронизации - см. РегистрСведений.СостоянияСинхронизацииОблачногоЭДО.ДатаСинхронизации
Функция ВыборкаДатыСинхронизацииПоТипу(ИдентификаторУчетнойЗаписи, ТипСинхронизации)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СостоянияСинхронизацииОблачногоЭДО.ДатаСинхронизации
		|ИЗ
		|	РегистрСведений.СостоянияСинхронизацииОблачногоЭДО КАК СостоянияСинхронизацииОблачногоЭДО
		|ГДЕ
		|	СостоянияСинхронизацииОблачногоЭДО.ИдентификаторУчетнойЗаписи = &ИдентификаторУчетнойЗаписи
		|	И СостоянияСинхронизацииОблачногоЭДО.ТипСинхронизации = &ТипСинхронизации";
		
	Запрос.УстановитьПараметр("ИдентификаторУчетнойЗаписи", ИдентификаторУчетнойЗаписи);
	Запрос.УстановитьПараметр("ТипСинхронизации", ТипСинхронизации);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

#КонецОбласти

#КонецЕсли
